InformationRegisters/vrgНастройкиМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>vrgНастройкиМобильныхУстройств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелУстройства</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.vrgМобильныеСклад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/vrgТипыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>vrgТипыОбменаДанными</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/vrgPortableDataTerminalExchange/Ext/Module.bsl
Функция ПолучитьДанные(КодУстройства)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);

	Если УзелУстройства.Пустая() Тогда
		ВызватьИсключение("Устройство с кодом " + КодУстройства+" не опознано");
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		ВызватьИсключение("Доступ к данным с этого устройства запрещен.");
	КонецЕсли;

	Результат = Истина;
	КомментарийПриЗагрузкеДанных = "";
	Попытка
	ДанныеОбмена = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыгрузитьДанныеНаМобильноеУстройство(УзелУстройства);
	Исключение
		ДанныеОбмена = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		Результат = Ложь;
		КомментарийПриЗагрузкеДанных = ОписаниеОшибки();
	КонецПопытки;

	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("УзелИнформационнойБазы", УзелУстройства);
	ДанныеНастройки.Вставить("ДатаПоследнейЗагрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("КомментарийПриЗагрузкеДанных", КомментарийПриЗагрузкеДанных);
	ДанныеНастройки.Вставить("ДатаНачалаЗагрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("ДатаПоследнегоОбмена", ТекущаяДата());
	ДанныеНастройки.Вставить("Результат", Результат);
	ДанныеНастройки.Вставить("ТипОбменаДанными", Перечисления.vrgТипыОбменаДанными.ЗагрузкаДанных);
	vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);

	Возврат ДанныеОбмена;

КонецФункции

Функция ЗаписатьДанные(КодУстройства, ДанныеМобильногоПриложения)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);

	Если УзелУстройства.Пустая() Тогда
		ВызватьИсключение("Устройство с кодом " + КодУстройства+" не опознано");
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		ВызватьИсключение("Доступ к данным с этого устройства запрещен.");
	КонецЕсли;

	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("УзелИнформационнойБазы", УзелУстройства);
	ДанныеНастройки.Вставить("ДатаПоследнейВыгрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("ДатаПоследнегоОбмена", ТекущаяДата());
	ДанныеНастройки.Вставить("КомментарийПриВыгрузкеДанных", "Операция произошла с ошибками: см. журнал регистрации");
	ДанныеНастройки.Вставить("ДатаНачалаВыгрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("Результат", Ложь);
	ДанныеНастройки.Вставить("ТипОбменаДанными", Перечисления.vrgТипыОбменаДанными.ВыгрузкаДанных);
	vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);

	Результат = Истина;
	КомментарийПриВыгрузкеДанных = "";
	Попытка
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ПринятьДанныеСМобильногоУстройства(УзелУстройства, ДанныеМобильногоПриложения, Истина);
		ДанныеНастройки.КомментарийПриВыгрузкеДанных = КомментарийПриВыгрузкеДанных;
		ДанныеНастройки.Результат = Результат;
		ДанныеНастройки.ДатаПоследнейВыгрузки = ТекущаяДата();
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);
	Исключение
		Результат = Ложь;
		КомментарийПриВыгрузкеДанных = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Выгрузка данных с устройства", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ПланыОбмена.vrgМобильныеСклад, УзелУстройства, КомментарийПриВыгрузкеДанных);
	КонецПопытки;

КонецФункции

Функция ВыполнитьНачальнуюИнициализацию(КодУстройства)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);

	Если УзелУстройства.Пустая() Тогда
		ВызватьИсключение("Устройство с кодом " + КодУстройства + " не опознано");
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		ВызватьИсключение("Доступ к данным с этого устройства запрещен.");
	КонецЕсли;

	Возврат vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыполнитьНачальнуюИнициализациюДляУзлаМобильногоУстройства(УзелУстройства);

КонецФункции

Функция Пинг(КодУстройства)
	Возврат Истина;
КонецФункции

Функция ИзменитьПараметрыНоменклатуры(КодУстройства, ДанныеОбмена, ТекстОшибки)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);
	Данные = Новый ХранилищеЗначения(Неопределено);

	Если УзелУстройства.Пустая() Тогда
		ТекстОшибки = ТекстОшибки + ("Устройство с кодом " + КодУстройства+" не опознано.");
		Возврат Данные;
	КонецЕсли;

	Попытка
		Данные = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ИзменитьПараметрыНоменклатуры(УзелУстройства, ДанныеОбмена, ТекстОшибки);
	Исключение
		ТекстОшибки = ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Данные;

КонецФункции

Функция ПолучитьКартинкуНоменклатуры(КодУстройства, Номенклатура, ПолучатьОнлайн, ТекстОшибки)

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);
	Данные = Новый ХранилищеЗначения(Неопределено);

	Если УзелУстройства.Пустая() Тогда
		ТекстОшибки = ТекстОшибки + ("Устройство с кодом " + КодУстройства+" не опознано.");
		Возврат Данные;
	КонецЕсли;

	Результат = Истина;
	Попытка
		Данные = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ПолучитьКартинкуНоменклатуры(УзелУстройства, Номенклатура, ПолучатьОнлайн, ТекстОшибки);
	Исключение
		Результат = Ложь;
		ТекстОшибки = ТекстОшибки + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Данные;

КонецФункции

Функция ОбновитьЦены(КодУстройства, ИдентификаторУстройства)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства);

	ДанныеОбмена = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыгрузитьЦеныНаМобильноеУстройство(УзелУстройства);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ДанныеОбмена;

КонецФункции

Функция ОбновитьОстатки(КодУстройства, ИдентификаторУстройства)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства);

	ДанныеОбмена = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыгрузитьОстаткиНаМобильноеУстройство(УзелУстройства);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ДанныеОбмена;

КонецФункции

Функция ПроверитьПарольПользователя(КодУстройства, Пользователь, Пароль, ТекстОшибки)

	СтруктураОтвета = Новый Структура();
	СтруктураОтвета.Вставить("ЗапретДоступа", Ложь);
	СтруктураОтвета.Вставить("ТекстОшибки", "");

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);

	Если УзелУстройства.Пустая() Тогда
		СтруктураОтвета.ЗапретДоступа = Истина;
		СтруктураОтвета.ТекстОшибки = "Устройство с кодом " + КодУстройства + " не опознано.";
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		Если УзелУстройства.ЗапретДоступа Тогда
			СтруктураОтвета.ЗапретДоступа = Истина;
			СтруктураОтвета.ТекстОшибки = "Доступ к данным с этого устройства запрещен.";
		КонецЕсли;
	КонецЕсли;

	Если СтруктураОтвета.ЗапретДоступа Тогда
		Возврат vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.СериализаторJSON(СтруктураОтвета);
	КонецЕсли;

	ЗаписьНастроек = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.УзелУстройства = УзелУстройства;
	ЗаписьНастроек.Прочитать();
	СтруктураОтвета.Вставить("ПарольНеверный", УзелУстройства.ПарольДляВходаНаУстройстве <> Пароль);
	СтруктураОтвета.Вставить("ИдентификаторУстройства", ЗаписьНастроек.ИдентификаторУстройства);
	СтруктураОтвета.Вставить("ПарольДляВходаНаУстройстве", УзелУстройства.ПарольДляВходаНаУстройстве);

	Возврат vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.СериализаторJSON(СтруктураОтвета);

КонецФункции

Функция ВыполнитьОбменДанными(КодУстройства, ИдентификаторУстройства, ДанныеМобильногоПриложения, ОбновлятьРегистрыСведений)

	УстановитьПривилегированныйРежим(Истина);

	УзелУстройства = ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства);

	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("УзелИнформационнойБазы", УзелУстройства);
	ДанныеНастройки.Вставить("ДатаПоследнейВыгрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("ДатаПоследнегоОбмена", ТекущаяДата());
	ДанныеНастройки.Вставить("КомментарийПриВыгрузкеДанных", "Операция произошла с ошибками: см. журнал регистрации");
	ДанныеНастройки.Вставить("ДатаНачалаВыгрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("Результат", Ложь);
	ДанныеНастройки.Вставить("ТипОбменаДанными", Перечисления.vrgТипыОбменаДанными.ВыгрузкаДанных);
	vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);

	Результат = Истина;
	КомментарийПриВыгрузкеДанных = "";
	Попытка
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ПринятьДанныеСМобильногоУстройства(УзелУстройства, ДанныеМобильногоПриложения);
		ДанныеНастройки.КомментарийПриВыгрузкеДанных = КомментарийПриВыгрузкеДанных;
		ДанныеНастройки.Результат = Результат;
		ДанныеНастройки.ДатаПоследнейВыгрузки = ТекущаяДата();
		vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);
	Исключение
		Результат = Ложь;
		КомментарийПриВыгрузкеДанных = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Выгрузка данных с устройства", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ПланыОбмена.vrgМобильныеСклад, УзелУстройства, КомментарийПриВыгрузкеДанных);
	КонецПопытки;

	Результат = Истина;
	КомментарийПриЗагрузкеДанных = "";
	Попытка
		ДанныеОбмена = vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ВыгрузитьДанныеНаМобильноеУстройство(УзелУстройства, ОбновлятьРегистрыСведений);
	Исключение
		ДанныеОбмена = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		Результат = Ложь;
		КомментарийПриЗагрузкеДанных = ОписаниеОшибки();
	КонецПопытки;

	ДанныеНастройки = Новый Структура;
	ДанныеНастройки.Вставить("УзелИнформационнойБазы", УзелУстройства);
	ДанныеНастройки.Вставить("ДатаПоследнейЗагрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("КомментарийПриЗагрузкеДанных", КомментарийПриЗагрузкеДанных);
	ДанныеНастройки.Вставить("ДатаНачалаЗагрузки", ТекущаяДата());
	ДанныеНастройки.Вставить("ДатаПоследнегоОбмена", ТекущаяДата());
	ДанныеНастройки.Вставить("Результат", Результат);
	ДанныеНастройки.Вставить("ТипОбменаДанными", Перечисления.vrgТипыОбменаДанными.ЗагрузкаДанных);
	vrgПроцедурыОбменаДаннымиСМобильнымиУстройствамиСклад.ЗафиксироватьЗавершениеОбмена(ДанныеНастройки);

	Возврат ДанныеОбмена;

КонецФункции

Функция ПолучитьПроверитьУзелУстройства(КодУстройства, ИдентификаторУстройства, ТекстОшибки = Неопределено)

	ИспользуетсяМобильноеПриложениеOctopus = Константы.vrg_ИспользуетсяМобильноеПриложениеOctopus.Получить();
	Если НЕ ИспользуетсяМобильноеПриложениеOctopus Тогда
		ВызватьИсключение("Синхронизация с мобильными устройствами отключена.");
	КонецЕсли;

	УзелУстройства = ПланыОбмена.vrgМобильныеСклад.НайтиПоКоду(КодУстройства);

	Если УзелУстройства.Пустая() Тогда
		ВызватьИсключение("Устройство с кодом " + КодУстройства+" не опознано");
	ИначеЕсли УзелУстройства.ЗапретДоступа Тогда
		ВызватьИсключение("Доступ к данным с этого устройства запрещен.");
	Иначе
		ЗаписьНастроек = РегистрыСведений.vrgНастройкиМобильныхУстройств.СоздатьМенеджерЗаписи();
		ЗаписьНастроек.УзелУстройства = УзелУстройства;
		ЗаписьНастроек.Прочитать();
		Если ЗаписьНастроек.Выбран() Тогда
			Если ЗначениеЗаполнено(ИдентификаторУстройства) И ЗначениеЗаполнено(ЗаписьНастроек.ИдентификаторУстройства)
				И ИдентификаторУстройства <> ЗаписьНастроек.ИдентификаторУстройства Тогда
				ВызватьИсключение("Данный узел обмена уже закреплен за другим устройством.");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат УзелУстройства;

КонецФункции
